In [2]:
import pandas as pd
import numpy as np

In [3]:
#criar funções para strip de strings
# criar tabulação para dataframe com diferentes números de coluns

In [4]:
a='     '
a.strip()

''

In [5]:
alfa='aaa000000aaaa'
alfa.lstrip('a')

'000000aaaa'

In [6]:
#Linkar tabelas via Pandas para justificar cada coisa
#Tipo um SQL

In [7]:
#lista_teste
lt = ['casa;canto;10','carro;arroz;11;cor','casa;canto;11','casa;ar;11','casa;perder;11']

In [8]:
df1=pd.DataFrame([[1,2,3],[1,1,1],[2,2,2],[4,4,4]],columns=['A','B','C'])
df2=pd.DataFrame([[1,2,2],[1,2,3]],columns=['A','B','C'])
df3=pd.DataFrame([[3,5,3],[4,3,3]],columns=['A','B','C'])
lista = [df1,df2,df3]

In [9]:
df1

   A  B  C
0  1  2  3
1  1  1  1
2  2  2  2
3  4  4  4

In [10]:
serie=df1['B']
serie

0    2
1    1
2    2
3    4
Name: B, dtype: int64

In [11]:
4 in serie

False

In [12]:
#Metodo correto para averiguar
2 in df1['B'].values

True

In [13]:
#CreateLogic to Find

In [14]:
#Teste Logica
df1['A'][0]==df2['A'][0]

True

In [15]:
#df1['A']==df2['B']

In [16]:
#Posso acessar diretamente o DF pela posição na lista de DFs
lista[1]

   A  B  C
0  1  2  2
1  1  2  3

In [17]:
for i in lista:
    display(i)

   A  B  C
0  1  2  3
1  1  1  1
2  2  2  2
3  4  4  4

   A  B  C
0  1  2  2
1  1  2  3

   A  B  C
0  3  5  3
1  4  3  3

 ### Novos cases   
    Analisar multiplos casos
    Selecionar o mais recente que contenha o caso ou os solicidados 

    Por exemplo:
    Os reportes mais novos devem conter o idunico e ao mesmo tempo as datas solicitadas
    Avaliar a situação do reporte e dar uma conclusão sobre ele ou sobre mais de um
    
    Fazer multiplos displays
    Comentar adequadamente cada função

In [18]:
dados = [['A',14,4],['B',1,2],['B',2,2],['C',0,0],['A',16,20],['B',1,10],['C',2,20]]
df=pd.DataFrame(dados,columns=['tipo','id','valor'])
df

  tipo  id  valor
0    A  14      4
1    B   1      2
2    B   2      2
3    C   0      0
4    A  16     20
5    B   1     10
6    C   2     20

In [19]:
#Varredura e identificação de blocos
df.iloc[[1,2],[0]]

  tipo
1    B
2    B

In [20]:
df.iloc[1:2, 0:1]

  tipo
1    B

In [21]:
#Merge?
(df.iloc[1:2, 0:1]).merge(df.iloc[[1,2],[0]])

  tipo
0    B
1    B

In [22]:
#Analise
df.iloc[1,1]==1

True

In [26]:
#Reporte
if df.iloc[1,1]==1:
    print('Reporte correto')
else:
    print('Reporte requisita analise')

Reporte correto

In [1]:
score = 67
if score < 80 and score > 70:
    print("A")
elif score < 90 or score > 80:
    print("B")
elif score > 60:
    print("C")
else:
    print("D")

B

In [3]:
def outer_function(a, b):
    def inner_function(c, d):
        return c + d
    return inner_function(a, b)
 
result = outer_function(5, 10)
print(result)

15

In [4]:
def foo(a, b=4, c=6):
    print(a, b, c)
 
foo(20, c=12)

20 4 12

In [5]:
def all_aboard(a, *args, **kw): 
    print(a, args, kw)
 
all_aboard(4, 7, 3, 0, x=10, y=64)

4 (7, 3, 0) {'x': 10, 'y': 64}

### Case Analise

In [ ]:
df = pd.read_csv('exemplo.csv')